Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Visual consciousness is empty of notions of “I” and “mine.”

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are empty of notions of “I” and “mine.”

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Visually compounded sensory contact is empty of notions of “I” and “mine.”

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are empty of notions of “I” and “mine.”

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་ཀྱིས་ཚོར་བ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Feelings conditioned by visually compounded sensory contact are empty of notions of “I” and “mine.”

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: Feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are empty of notions of “I” and “mine.”

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: The perfection of generosity is empty of notions of “I” and “mine.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty of notions of “I” and “mine.” [

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ནི་བདག་གམ་བདག་གིས་སྟོང་ངོ་།
en: The causal attributes], up to and including the factors conducive to enlightenment, are empty of notions of “I” and “mine.” [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་ནི་བདག་གམ་བདག་གིས་སྟོང་ན།
en: The fruitional attributes], up to and including the distinct qualities of the buddhas, are empty of notions of “I” and “mine.”

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་ཡང་ཅི་ཞིག་བྱ་ཞེས་ཟེར་བ་དེ་ལྟ་བུའི་བདུད་ཀྱི་ལས་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ།
en: So what can you do to achieve consummate buddhahood in unsurpassed, complete enlightenment?’ In so saying they will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ཏེ། འདི་སྐད་དུ་རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: Moreover, Subhūti, malign māras will transform themselves into the guise of a buddha, and approach bodhisattva great beings, saying, ‘O noble child, the eastern direction is empty of lord buddhas, bodhisattvas, and śrāvakas.

source: འདི་ལ་སངས་རྒྱས་ཞེས་བྱ་བ་ཡང་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ཡང་མེད་དོ། །ཉན་ཐོས་ཞེས་བྱ་བ་ཡང་མེད་དོ། །ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་།
en: In it there are indeed no lord buddhas, no bodhisattvas, and no śrāvakas.

source: ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་བཅུ་ཀུན་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: All the ten directions, including the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, are also empty of lord buddhas, bodhisattvas, and śrāvakas.

source: འདི་ལ་སངས་རྒྱས་ཞེས་བྱ་བ་ཡང་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ཡང་མེད་དོ།
en: In them there are indeed no lord buddhas, no bodhisattvas, and no śrāvakas.’

source: །ཉན་ཐོས་ཞེས་བྱ་བ་ཡང་མེད་དོ་ཞེས་ཟེར་བ་དེ་ལྟ་བུའི་བདུད་ཀྱི་ལས་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ།
en: In so saying they will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་ཉན་ཐོས་ཀྱི་ཆ་བྱད་དུ་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་ལས་ཟློག་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་འདེམས་པ་དང་།
en: Moreover, Subhūti, malign māras will transform themselves into the guise of a śrāvaka, and approach bodhisattva great beings, preventing them from focusing their attention with all-aspect omniscience in mind, and promoting and advocating the considerations of śrāvakas and pratyekabuddhas.

source: རྗེས་སུ་སྟོན་པ་དེ་ལྟ་བུའི་བདུད་ཀྱི་ལས་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག །མཁན་པོ་དང་སློབ་དཔོན་གྱི་ཆ་བྱད་དུ་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ཏེ།
en: They will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings. “

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལས་ཟློག་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་ལས་ཟློག་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྦྱོར་བ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་།
en: Moreover, Subhūti, malign māras will transform themselves into the guise of a monastic preceptor or an authentic master, and approach bodhisattva great beings, averting them from the conduct of the bodhisattvas and preventing them from focusing their attention with all-aspect omniscience in mind while engaging with the applications of mindfulness, and engaging with the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and while engaging with [the fruitional attributes], up to and including emptiness, signlessness, and wishlessness, saying, ‘O noble child, if you cultivate these attributes, you will actualize the level of the śrāvakas!

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྦྱོར་བ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་བར་གྱི་ཆོས་རྣམས་ལ་སྦྱོར་ཞིང་།
en: What will you achieve through unsurpassed, complete enlightenment?’

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་དེ་དག་ཡོངས་སུ་བསྒོམས་ལ། ཉན་ཐོས་ཀྱིས་མངོན་དུ་གྱིས་ཤིག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱིས་ཁྱོད་ལ་ཅི་ཞིག་བྱ་ཞེས་ཟེར་བ་དེ་ལྟ་བུའི་བདུད་ཀྱི་ལས་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ།
en: They will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings. {

source: །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་ཕ་དང་མའི་ཆ་བྱད་དུ་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ཏེ། འདི་སྐད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པས་ཁྱོད་ལ་ཅི་ཞིག་བྱ།
en: Dt.160} “Moreover, Subhūti, malign māras will transform themselves into the guise of a parent, and approach bodhisattva great beings, saying, ‘What will you achieve through consummate buddhahood in unsurpassed, complete enlightenment?

source: དེའི་དོན་དུ་ནི་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པར་འཁོར་བ་ན་འཁོར་ཞིང་། རྐང་ལག་དང་མགོ་བཅད་པ་ཚད་མེད་པས་ཉོན་མོངས་པར་འགྱུར་གྱིས།
en: To what end do you roam in cyclic existence, for inestimable countless eons, afflicted by countless amputations of the hands and feet, and decapitations?

source: གང་ལ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱར་ཡོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱར་ཡོད་པ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱར་ཡོད་པ་དང་།
en: You should persevere in those teachings that actualize the fruit of entering the stream to nirvāṇa, that actualize the fruit of being destined for only one more rebirth, that actualize the fruit of no longer being subject to rebirth, and that actualize the fruit of arhatship.’

source: དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱར་ཡོད་པ་དེ་ལ་བརྩོན་པར་གྱིས་ཤིག་ཅེས་ཟེར་བ་དེ་ལྟ་བུའི་བདུད་ཀྱི་ལས་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བདུད་སྡིག་ཏོ་ཅན་དག་དགེ་སློང་གི་ཆ་བྱད་དུ་བྱས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ཏེ།
en: They will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings. “

source: གཟུགས་མི་རྟག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། གཟུགས་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: Moreover, Subhūti, malign māras will transform themselves into the guise of a monk, and approach bodhisattva great beings, teaching, by way of apprehending, that physical forms are impermanent, and teaching, by way of apprehending, that physical forms are imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། མིག་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། གཟུགས་མི་རྟག་ཅེས་བྱ་བ་དང་། གཟུགས་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: They will teach, by way of apprehending, that feelings, perceptions, formative predispositions, and consciousness are impermanent, and teach, by way of apprehending, that consciousness [and the other aggregates] are imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: མིག་གི་རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་།
en: They will teach, by way of apprehending, that the eyes are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void; and they will teach, by way of apprehending, that the ears, nose, tongue, body, and mental faculty are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་།
en: They will teach, by way of apprehending, that sights are impermanent, and that sights are imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void; and they will teach, by way of apprehending, that sounds, odors, tastes, tangibles, and mental phenomena are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: They will teach, by way of apprehending, that visually compounded sensory contact is impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void; and they will teach, by way of apprehending, that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་།
en: They will teach, by way of apprehending, that feelings conditioned by visually compounded sensory contact are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void; and they will teach, by way of apprehending, that feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void. “

source: དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་བར་དུ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་།
en: They will teach, by way of apprehending, that the applications of mindfulness are impermanent, imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void; and they will teach, by way of apprehending, that [all other causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are impermanent, imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དེ་ལྟ་བུའི་འདུད་ཀྱི་ལས་ཀྱི་རྣམ་པ་དག་མི་སྨྲ་མི་སྟོན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱའོ།
en: They will not mention or reveal these aspects of their demonic activity, but these you should know to be the evil associates of bodhisattva great beings.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྡིག་པའི་གྲོགས་པོ་དག་རིག་པར་བྱ་སྟེ།
en: So it is that bodhisattva great beings should know these evil associates.

source: དེ་ལྟར་ཤེས་ནས་ཀྱང་ཡོངས་སུ་སྤོང་བར་བྱའོ།
en: Having understood them in that manner, you should abandon them!”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་བདུན་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This completes the seventh chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཚིག་འདིའི་དོན་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Chapter 8 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, when you say ‘bodhisattva,’ what is the actual entity denoted by this word bodhisattva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་ནི། ཚིག་གི་དོན་མེད་པ་སྟེ།
en: The Blessed One replied to the venerable Subhūti as follows: “Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་ཀྱང་མ་སྐྱེས་ལ། སེམས་ཅན་ཡང་མ་སྐྱེས་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because bodhi (enlightenment) is nonarising and sattva (a being) is nonarising, too.

source: རབ་འབྱོར་བྱང་ཆུབ་ལ་ཡང་ཚིག་མེད། སེམས་ཅན་ལ་ཡང་ཚིག་མེད་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་ནི་ཚིག་གི་དོན་མེད་པའོ།
en: Subhūti, in enlightenment there is no word, and in a being there is no word. Therefore, the actual entity denoted by the word bodhisattva is not an actual entity. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་བྱའི་རྗེས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as in the sky there are no tracks left by birds, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་རྨི་ལམ་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as a dream is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སྒྱུ་མ་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as a magical display is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སྨིག་རྒྱུ་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as a mirage is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་ཆུ་ཟླ་དང་སྒྲ་བརྙན་དང་མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་བ་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as the moon in water, an echo, an optical aberration, a reflection, and a phantom emanation of the tathāgatas are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity. {

source: ཡང་དག་པའི་མཐའ་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་།
en: Dt.161} Subhūti, just as the very limit of reality is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity.

source: ཆོས་ཀྱི་དབྱིངས་ཉིད་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as the unmistaken real nature, the one and only real nature, reality, the realm of phenomena, the abiding nature of all phenomena, and the maturity of all phenomena are without any basis, likewise, Subhūti, the actual entity denoted by the word bodhisattva is not an actual entity. “

source: སྒྱུ་མའི་སྐྱེས་བུའི་གཟུགས་ལ་གནས་མེད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་མེད་དོ།
en: Subhūti, just as the physical form of an illusory person is without any basis, and just as the feelings, perceptions, formative predispositions, and consciousness [of an illusory person] are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་མིག་ལ་གནས་མེད་དོ། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་གནས་མེད་དོ།
en: Subhūti, just as the eyes of an illusory person are without any basis, and just as the ears, nose, tongue, body, and mental faculty of an illusory person are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སྒྱུ་མའི་སྐྱེས་བུའི་གཟུགས་ལ་གནས་མེད་དོ། །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ལ་གནས་མེད་དོ།
en: Subhūti, just as the sights of an illusory person are without any basis, and just as the sounds, odors, tastes, tangibles, and mental phenomena of an illusory person are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སྒྱུ་མའི་སྐྱེས་བུའི་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་གནས་མེད་དོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་གནས་མེད་དོ།
en: Subhūti, just as the visual consciousness of an illusory person is without any basis, and just as the auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness of an illusory person are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སྒྱུ་མའི་སྐྱེས་བུའི་མིག་གི་འདུས་ཏེ་རེག་པ་ལ་གནས་མེད་དོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལ་གནས་མེད་དོ།
en: Subhūti, just as the visually compounded sensory contact of an illusory person is without any basis, and just as the aurally compounded sensory contact, the nasally compounded sensory contact, the lingually compounded sensory contact, the corporeally compounded sensory contact, and the mentally compounded sensory contact of an illusory person are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.
